In [12]:
import pandas as pd

In [13]:
data=pd.read_csv('music.csv')
data.head()

   age  gender     genre
0   20       1  HipHop-m
1   23       1  HipHop-m
2   25       1  HipHop-m
3   26       1    Jazz-m
4   29       1    Jazz-m

In [14]:
#Delimited String in dataframe
data[['A', 'B']] = data['genre'].str.split('-', 1, expand=True)
data.head()

   age  gender     genre       A  B
0   20       1  HipHop-m  HipHop  m
1   23       1  HipHop-m  HipHop  m
2   25       1  HipHop-m  HipHop  m
3   26       1    Jazz-m    Jazz  m
4   29       1    Jazz-m    Jazz  m

In [15]:
#Data filtring (&=and, |=or)
ds = data.query('gender == 1 & age != 20')
ds

   age  gender        genre          A  B
1   23       1     HipHop-m     HipHop  m
2   25       1     HipHop-m     HipHop  m
3   26       1       Jazz-m       Jazz  m
4   29       1       Jazz-m       Jazz  m
5   30       1       Jazz-m       Jazz  m
6   31       1  Classical-m  Classical  m
7   33       1  Classical-m  Classical  m
8   37       1  Classical-m  Classical  m

In [16]:
# Applying a function to every row using lambda
#The normaul wat to write a function
def myfunc(x):
    return x+5

print(myfunc(2))

7

In [20]:
# myfunc2=lambda prameters:function_body
myfunc2=lambda x:x+5

print(myfunc2(2))

7

In [22]:
#other example of lambda
func3=lambda x,y:x+y
print(func3(5,5))

10

In [23]:
#optional parameter with lambda
func4=lambda x,y=3:x+y

print(func4(5))

8

In [25]:
# lambda with no parameter
from datetime import datetime
func5=lambda :datetime.today().strftime('%Y-%m-%d')
print(func5())

2021-06-18

In [29]:
# 
a=[1,2,3,4,5,6,7,8,9,10]
newlist=list(map(lambda x:x+5,a))
print(newlist)

[6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

In [30]:
b=[1,2,3,4,5,6,7,8,9,10]
evenNumbers=list(filter(lambda x:x%2==0,b))
print(evenNumbers)

[2, 4, 6, 8, 10]